#include <iostream>

int main()
{
    
}


/*
Самостоятельная задача: Реализуйте простую систему управления библиотекой на C++
Реализуйте простую систему управления библиотекой на C++. 
Ваша основная задача - спроектировать класс Book, который инкапсулирует свойства и поведение книги, 
включая название, автора, год публикации и статус доступности. 
Вы изучите основы объектно-ориентированного программирования, используя конструкторы по умолчанию 
и параметризованные конструкторы для инициализации объектов книг, реализуя деструктор 
для понимания управления жизненным циклом объекта, и применяя перегрузку методов для обновления информации 
о книге различными способами.
*/